In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
dfBank = pd.read_csv("Churn.csv")

In [3]:
dfBank.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [18]:
dfBank.shape

(10000, 14)

In [20]:
#Lets drop unwamted columns - CustomerId, Surname
dfBank.drop(columns=['CustomerId','Surname'], inplace=True)

In [22]:
dfBank.drop(columns=['RowNumber'], inplace=True)

In [23]:
dfBank.dtypes

CreditScore          int64
Geography           object
Gender              object
Age                  int64
Tenure               int64
Balance            float64
NumOfProducts        int64
HasCrCard            int64
IsActiveMember       int64
EstimatedSalary    float64
Exited               int64
dtype: object

In [41]:
#dfBank['Geography'].value_counts()
dfBank['Exited'].value_counts()

0    7963
1    2037
Name: Exited, dtype: int64

In [43]:
#Lets do encoding....
dfBank = pd.get_dummies(dfBank, columns=["Geography", "Gender","HasCrCard","IsActiveMember"])

In [44]:
dfBank.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,EstimatedSalary,Exited,Geography_France,Geography_Germany,Geography_Spain,Gender_Female,Gender_Male,HasCrCard_0,HasCrCard_1,IsActiveMember_0,IsActiveMember_1
0,619,42,2,0.00,1,101348.88,1,1,0,0,1,0,0,1,0,1
1,608,41,1,83807.86,1,112542.58,0,0,0,1,1,0,1,0,0,1
2,502,42,8,159660.80,3,113931.57,1,1,0,0,1,0,0,1,1,0
3,699,39,1,0.00,2,93826.63,0,1,0,0,1,0,1,0,1,0
4,850,43,2,125510.82,1,79084.10,0,0,0,1,1,0,0,1,0,1

In [47]:
# Create input attribute set by dropping
X  = dfBank.drop("Exited",axis=1)

In [48]:
X.dtypes

CreditScore            int64
Age                    int64
Tenure                 int64
Balance              float64
NumOfProducts          int64
EstimatedSalary      float64
Geography_France       uint8
Geography_Germany      uint8
Geography_Spain        uint8
Gender_Female          uint8
Gender_Male            uint8
HasCrCard_0            uint8
HasCrCard_1            uint8
IsActiveMember_0       uint8
IsActiveMember_1       uint8
dtype: object

In [49]:
# Labels
y = dfBank.pop("Exited")

In [52]:
from sklearn.model_selection import train_test_split

In [53]:
# Split the data up in train and test sets
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.30, random_state=42)

In [54]:
#Lets standardize the data
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler().fit(X_train)
X_train = scaler.transform(X_train)
X_test = scaler.transform(X_test)

In [55]:
from tensorflow.keras import Sequential
from tensorflow.keras.layers import Dense
from tensorflow.keras.layers import ReLU

ModuleNotFoundError: No module named 'tensorflow'

In [ ]:
# define the model architecture

# Initialize the constructor
model = Sequential()
# Add an input layer 
model.add(Dense(30, activation='relu', input_shape=(11,)))

# Add an output layer 
model.add(Dense(1, activation='sigmoid'))